---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevRotateWithComponent
source: html/2839d5d5-7ae1-b5d6-e5b9-495ba6f9d274.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevRotateWithComponent Property

"Rotate with Component"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevRotateWithComponent { get; }
```